hw/app/controllers/cars_controller.rb

INSERT INTO "cars" ("make", "model", "year", "moonroof", "created_at", "updated_at", "color") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["make", "Toyota"], ["model", "2000"], ["year", 2019], ["moonroof", true], ["created_at", "2019-03-05 13:35:42.014457"], ["updated_at", "2019-03-05 13:35:42.014457"], ["color", "red"]]
---
  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save