hw/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "HELLO"], ["content", "WORLD!"], ["created_at", "2019-03-05 07:51:23.718467"], ["updated_at", "2019-03-05 07:51:23.718467"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save